Repository: Fady2024/GreeAlexApp
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: GreeAlex
ar: جرين اليكس

# welcomeSlogan
source: Earn points. Help the planet.
ar: اكسب نقاط. ساعد الكوكب.

source: Get Started
ar: ابدأ الآن

source: In partnership with
ar: بالشراكة مع

source: Welcome back,
ar: أهلاً بعودتك،

# leaderboardAndRewards
source: Leaderboard & Rewards
ar: لوحة المتصدرين والمكافآت

source: Suggested Eco Actions
ar: إجراءات بيئية مقترحة

source: Our Partners
ar: شركاؤنا

# recyclePlasticBottlesTitle
source: Recycle Plastic Bottles
ar: إعادة تدوير الزجاجات البلاستيكية

# recyclePlasticBottlesDescription
source: Collect and recycle 10 plastic bottles
ar: اجمع وأعد تدوير 10 زجاجات بلاستيكية

# recycingCategory
source: Recycling
ar: إعادة تدوير

# publicTransportTitle
source: Use Public Transport
ar: استخدام وسائل النقل العام

# publicTransportDescription
source: Use public transport for a week
ar: استخدم وسائل النقل العام لمدة أسبوع

# transportCategory
source: Transport
ar: مواصلات

# plantTreeTitle
source: Plant a Tree
ar: ازرع شجرة

# plantTreeDescription
source: Plant and care for a new tree
ar: ازرع واعتنِ بشجرة جديدة

# gardeningCategory
source: Gardening
ar: بستنة

# reduceEnergyTitle
source: Reduce Energy Consumption
ar: تقليل استهلاك الطاقة

# reduceEnergyDescription
source: Lower your electricity bill by 10%
ar: خفض فاتورة الكهرباء بنسبة 10٪

# energyCategory
source: Energy
ar: طاقة

# beachCleanupTitle
source: Beach Cleanup Day
ar: يوم تنظيف الشاطئ

# beachCleanupDescription
source: Join us in cleaning Alexandria's beaches
ar: انضم إلينا في تنظيف شواطئ الإسكندرية

# treePlantingTitle
source: Tree Planting Initiative
ar: مبادرة زراعة الأشجار

# treePlantingDescription
source: Help us make Alexandria greener
ar: ساعدنا في جعل الإسكندرية أكثر خضرة

source: Leaderboard
ar: المتصدرون

source: Rewards
ar: المكافآت

source: Top Contributors
ar: أبرز المساهمين

# climbTheRanks
source: Keep going green to climb the ranks!
ar: استمر في الحفاظ على البيئة لترتقي في الترتيب!

source: Filter by category:
ar: تصفية حسب الفئة:

# noRewardsInCategory
source: No rewards available in this category.
ar: لا توجد مكافآت متاحة في هذه الفئة.

source: Redeem Reward
ar: استبدال المكافأة

# confirmRedeemMessage
source: Are you sure you want to redeem this reward?
ar: هل أنت متأكد أنك تريد استبدال هذه المكافأة؟

# deductPointsMessage
source: This will deduct {points} points from your balance.
ar: سيؤدي هذا إلى خصم {points} نقطة من رصيدك.

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

# successfullyRedeemedMessage
source: Successfully redeemed {rewardTitle}!
ar: تم استبدال {rewardTitle} بنجاح!

# categoryAll
source: All
ar: الكل

# categoryBanking
source: Banking
ar: خدمات بنكية

# categorySustainability
source: Sustainability
ar: الاستدامة

# categoryLifestyle
source: Lifestyle
ar: أسلوب حياة

# categoryShopping
source: Shopping
ar: تسوق

# rewardSavingsBonusTitle
source: AlexBank Savings Bonus
ar: مكافأة توفير من بنك الإسكندرية

# rewardSavingsBonusDescription
source: Get 0.5% extra interest on your savings account for 3 months
ar: احصل على فائدة إضافية بنسبة 0.5٪ على حساب التوفير الخاص بك لمدة 3 أشهر

# rewardFeeWaiverTitle
source: Credit Card Fee Waiver
ar: إعفاء من رسوم بطاقة الائتمان

# rewardFeeWaiverDescription
source: Free annual fee on your AlexBank credit card
ar: إعفاء من الرسوم السنوية على بطاقتك الائتمانية من بنك الإسكندرية

# rewardPlantTreeTitle
source: Plant a Tree
ar: ازرع شجرة

# rewardPlantTreeDescription
source: We'll plant a tree in your name in Alexandria
ar: سنقوم بزراعة شجرة باسمك في الإسكندرية

# partnerAlexBankGreenInitiative
source: AlexBank Green Initiative
ar: مبادرة بنك الإسكندرية الخضراء

# rewardFreeCoffeeTitle
source: Free Coffee
ar: قهوة مجانية

# rewardFreeCoffeeDescription
source: Get a free coffee at partner cafes
ar: احصل على فنجان قهوة مجاني في المقاهي الشريكة

# partnerLocalCoffee
source: Local Coffee Partners
ar: شركاء القهوة المحليون

# rewardInvestmentConsultationTitle
source: Investment Consultation
ar: استشارة استثمارية

# rewardInvestmentConsultationDescription
source: Free 30-minute session with an AlexBank financial advisor
ar: جلسة مجانية لمدة 30 دقيقة مع مستشار مالي من بنك الإسكندرية

# rewardShoppingVoucherTitle
source: Shopping Voucher
ar: قسيمة تسوق

# rewardShoppingVoucherDescription
source: EGP 100 voucher for eco-friendly products
ar: قسيمة بقيمة 100 جنيه مصري للمنتجات الصديقة للبيئة

# partnerGreenShopping
source: Green Shopping Partners
ar: شركاء التسوق الأخضر

# rewardLoanDiscountTitle
source: Loan Rate Discount
ar: خصم على سعر القرض

# rewardLoanDiscountDescription
source: 0.25% discount on your next personal loan rate
ar: خصم 0.25٪ على سعر الفائدة لقرضك الشخصي التالي

# partnerAlexBank
source: AlexBank
ar: بنك الإسكندرية

# rewardCashbackTitle
source: Cashback on Transactions
ar: استرداد نقدي على المعاملات

# rewardCashbackDescription
source: Get 5% cashback on all transactions made with your AlexBank card for a week.
ar: احصل على استرداد نقدي بنسبة 5٪ على جميع المعاملات التي تتم باستخدام بطاقة بنك الإسكندرية الخاصة بك لمدة أسبوع.

# rewardEcoDiscountTitle
source: Eco-Friendly Product Discount
ar: خصم على المنتجات الصديقة للبيئة

# rewardEcoDiscountDescription
source: Get a 20% discount on a selection of eco-friendly products.
ar: احصل على خصم 20٪ على مجموعة مختارة من المنتجات الصديقة للبيئة.

# partnerGreenFutureStore
source: Green Future Store
ar: متجر المستقبل الأخضر

# rewardsPromoTitle
source: AlexBank & Green Future
ar: بنك الإسكندرية والمستقبل الأخضر

# rewardsPromoSubtitle
source: Earn exclusive rewards for your sustainable actions and banking with AlexBank.
ar: اكسب مكافآت حصرية على أفعالك المستدامة ومعاملاتك مع بنك الإسكندرية.

# partnersTitle
source: Our Partners
ar: شركاؤنا

# partnerBanlasticDescription
source: An Egyptian initiative specialized in eliminating single-use plastic and organizing environmental events.
ar: مبادرة مصرية متخصصة في القضاء على البلاستيك أحادي الاستخدام وتنظيم فعاليات بيئية.

# partnerBanlasticActivity1
source: Beach cleanups
ar: تنظيف الشواطئ

# partnerBanlasticActivity2
source: Environmental awareness workshops
ar: ورش توعية بيئية

# partnerBanlasticActivity3
source: Anti-plastic campaigns
ar: حملات ضد البلاستيك

# partnerBanlasticPartnership
source: We agreed that any volunteer participating in their events can scan a QR Code and get points on the app.
ar: اتفقنا معاهم إن أي متطوع يشارك في فعالية لهم، يقدر يمسح QR Code وياخد Points على التطبيق.

# partnerGreenishDescription
source: A youth initiative focused on environmental education and working with university students in Egypt.
ar: مبادرة شبابية تركز على التعليم البيئي والعمل مع طلاب الجامعات في مصر.

# partnerGreenishActivity1
source: Environmental education
ar: تعليم بيئي

# partnerGreenishActivity2
source: Student projects
ar: مشاريع طلابية

# partnerGreenishActivity3
source: Workshops
ar: ورش عمل

# partnerGreenishPartnership
source: We agreed they would nominate youth events to link with the app, giving volunteers points for their participation.
ar: اتفقنا معاهم يرشحوا فعاليات شبابية نربطها بالتطبيق، ويدوا المتطوعين نقاط على مشاركتهم.

# partnerVeryNileDescription
source: A leading initiative to clean the Nile River from plastic and organize volunteer events.
ar: مبادرة رائدة لتنظيف نهر النيل من البلاستيك وتنظيم فعاليات تطوعية.

# partnerVeryNileActivity1
source: Nile cleanups
ar: تنظيف النيل

# partnerVeryNileActivity2
source: Recycling
ar: إعادة تدوير

# partnerVeryNileActivity3
source: Environmental awareness
ar: توعية بيئية

# partnerVeryNilePartnership
source: We partnered with them so anyone participating in Nile cleanup days can enter a code on GreeAlex and get points.
ar: عملنا شراكة معاهم علشان أي حد يشارك في أيام تنظيف النيل، يقدر يدخل الكود على GreeAlex وياخد Points.

# partnerYLEDescription
source: An Egyptian association aiming to achieve sustainable development and organizing environmental volunteer events.
ar: جمعية مصرية تهدف لتحقيق التنمية المستدامة وتنظم فعاليات تطوعية بيئية.

# partnerYLEActivity1
source: Sustainable development
ar: تنمية مستدامة

# partnerYLEActivity2
source: Volunteer work
ar: عمل تطوعي

# partnerYLEActivity3
source: Environmental initiatives
ar: مبادرات بيئية

# partnerYLEPartnership
source: We agreed they would announce events on the app, and anyone who participates can add a QR from the location and get points.
ar: اتفقنا معاهم إنهم يعلنوا عن فعاليات على التطبيق، وأي حد يشارك يقدر يضيف QR من المكان وياخد نقاط.

# partnerBekiaDescription
source: An Egyptian company specializing in waste recycling and exchanging it for points or rewards.
ar: شركة مصرية متخصصة في تدوير النفايات واستبدالها بنقاط أو مكافآت.

# partnerBekiaActivity1
source: Waste recycling
ar: تدوير نفايات

# partnerBekiaActivity2
source: Exchanging waste for points
ar: استبدال المخلفات بنقاط

# partnerBekiaActivity3
source: Environmental awareness
ar: توعية بيئية

# partnerBekiaPartnership
source: We collaborated with them to let users link their Bekia account with GreeAlex and get points for recycling.
ar: عملنا شراكة معاهم علشان المستخدمين يقدروا يربطوا حساب Bekia بتاعهم مع GreeAlex وياخدوا نقاط على إعادة التدوير.

# profileTitle
source: Profile
ar: الملف الشخصي

source: My Volunteering History
ar: تاريخ العمل التطوعي

source: Logout
ar: تسجيل الخروج

source: Edit Profile
ar: تعديل الملف الشخصي

source: Eco Champion
ar: بطل البيئة

source: Eco Hero
ar: بطل إيكولوجي

source: Eco Starter
ar: مبتدئ إيكولوجي

source: Eco Newbie
ar: جديد في البيئة

# historyBeachCleanupTitle
source: Beach Cleanup Day
ar: يوم تنظيف الشاطئ

# historyFoodDonationTitle
source: Food Donation Drive
ar: حملة التبرع بالطعام

# locationMontazaBeach
source: Montaza Beach
ar: شاطئ المنتزه

# locationSanStefano
source: San Stefano
ar: سان ستيفانو

# participantsCount
source: {count}/{max} participants
ar: {count}/{max} مشارك

# greenPointsAbbreviation
source: {points} GP
ar: {points} ن.خ

# historyRecyclingWorkshopTitle
source: Recycling Workshop
ar: ورشة إعادة التدوير

# historyTreePlantingTitle
source: Tree Planting Initiative
ar: مبادرة زراعة الأشجار

source: Volunteering Opportunities
ar: فرص العمل التطوعي

source: See All
ar: عرض الكل

# chatbotTitle
source: GreenAlex Bot
ar: جرينو

# chatbotSubtitle
source: Sustainability Assistant
ar: مساعد الاستدامة

# chatbotWelcome
source: Hello! I'm GreenAlex Bot, your sustainable assistant for Alexandria! I can help you with eco-friendly actions, AlexBank services, and earning Green Points. What can I help you with today?
ar: 👋 مرحباً! أنا جرينو، مساعدك المستدام في الإسكندرية! يمكنني مساعدتك في الأعمال الصديقة للبيئة وخدمات بنك الإسكندرية وكسب النقاط الخضراء. كيف يمكنني مساعدتك اليوم؟

# chatbotTooltip
source: Ask me about sustainability!
ar: اسألني عن الاستدامة!

# chatInputPlaceholder
source: Ask about sustainability, banking, points...
ar: اسأل عن الاستدامة أو الخدمات المصرفية أو النقاط...

source: Clear Chat
ar: مسح الدردشة

# clearChatConfirm
source: Are you sure you want to clear all messages?
ar: هل أنت متأكد أنك تريد مسح جميع الرسائل؟

# chatHelp
source: How can I help you?
ar: كيف يمكنني مساعدتك؟

# chatHelpSustainability
source: Sustainability Tips
ar: نصائح الاستدامة

# chatHelpSustainabilityDesc
source: Get eco-friendly actions and tips for Alexandria
ar: احصل على أعمال ونصائح صديقة للبيئة في الإسكندرية

# chatHelpBanking
source: AlexBank Services
ar: خدمات بنك الإسكندرية

# chatHelpBankingDesc
source: Learn about green banking and sustainable finance
ar: تعرف على الخدمات المصرفية الخضراء والتمويل المستدام

# chatHelpPoints
source: Green Points
ar: النقاط الخضراء

# chatHelpPointsDesc
source: Discover ways to earn and redeem points
ar: اكتشف طرق كسب واستبدال النقاط

# chatHelpEvents
source: Events & Volunteering
ar: الفعاليات والعمل التطوعي

# chatHelpEventsDesc
source: Find volunteer opportunities and events
ar: اعثر على فرص العمل التطوعي والفعاليات

# chatHelpFooter
source: Just type your question naturally, and I'll help you out!
ar: فقط اكتب سؤالك بشكل طبيعي، وسأساعدك!

# startConversation
source: Start a conversation
ar: ابدأ محادثة

# startConversationDesc
source: Ask me about sustainability, AlexBank services, or how to earn Green Points!
ar: اسألني عن الاستدامة، خدمات بنك الإسكندرية، أو كيفية كسب النقاط الخضراء!

# featureNotAvailableOnWeb
source: This feature is not available on the web version.
ar: هذه الميزة غير متوفرة على نسخة الويب.

source: Scanned Code
ar: الرمز الذي تم مسحه

source: Scan QR Code
ar: مسح رمز الاستجابة السريعة

source: Home
ar: الرئيسية

source: Profile
ar: ملفي الشخصي
